OpenFOAM/OpenFOAM-2.2.x/tutorials/incompressible/pisoFoam/les/motorBike/motorBike/0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0.05;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.05;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.05;
        value           uniform 0.05;
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    "motorBike_.*"
    {
        type            fixedValue;
        value           uniform 0;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            symmetryPlane;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
